Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs.GetSelectedExternalItems
Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog.
Remarks:
If more than one add-in has registered external items, this will report items enabled for transfer for all such add-ins.  Add-ins should handle the transfer only for those items which they actually registered in the TransferringProjectStandards event.
Returns:
External items user wants to transfer.
Since:
2017.2

Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs.TargetDocument
Target document.
Since:
2017.2

Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs.SourceDocument
Source document.
Since:
2017.2

Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs
The event arguments used by the TransferredProjectStandards event.
Since:
2017.2